{
    "name": "Thamer Naouech",
    "headerTaglineOne": "Hello 👋",
    "headerTaglineTwo": "I am Thamer Naouech",
    "headerTaglineThree": "",
    "headerTaglineFour": "",
    "showCursor": false,
    "showBlog": true,
    "darkMode": false,
    "showResume": true,
    "socials": [
        
        {
            "id": "2",
            "title": "LinkedIn",
            "link": "t.naouech@tum.de"
        },
        
        
        {
            "id": "5",
            "title": "Email",
            "link": "mailto:t.naouech@tum.de"
        }
    ],
    "projects": [
        
    ],
    "services": [],
    "aboutpara": "Hi, I’m Thamer Naouech 🚀 – an aspiring aerospace engineering student at the Technical University of Muncih, passionate about exploring the skies 🌌 and pushing the boundaries of innovation ✈️. With a curiosity-driven mindset 🤔 and a love for technology 💡, I aim to design and develop solutions that shape the future of aviation and space exploration 🌍✨.",
    "resume": {
        "tagline": "👋  I'm an aerospace engineering student at the Technical University of Munich",
        "description": "I’m currently a B.Sc. Aerospace Engineering student at TUM with a deep passion for advancing technologies and exploring the wonders of science across all fields. Fascinated by innovation, I thrive on creating solutions that push boundaries and shape the future of aerospace and beyond.",
        
        "education": [
            {"id": "1",
            "universityName": "Technical University of Munich",
            "universityDegree": "Bachelor of Science in Aerospace Engineering",
            "universityDate": "Munich, Germany | October 2022 - Present ",
            "GPA": "1,3 so far (German Grade System)",
            "universityPara1": "Coursework: Engineering Mechanics, Multi-variable Calculus, Differential Equations, CAD, Thermodynamics, Fluid Mechanics, Control Theory, Programming, Astrophysics, Electrical Engineering."
            },
            {"id": "2",
            "universityName": "IPEST-Tunis (Preparatory Institute for Scientific and Technological Studies)",
            "universityDegree": "Engineering Preparatory Course in Mathematics, Physics and Computer Science",
            "universityDate": " Tunis, Tunisia | September 2021 - May 2022",
            "universityPara": "Admitted to top preparatory college for Engineering Studies in Tunisia.",
            "GPA": "1,0 (German Grade System) (interrupted)",
            "universityPara1": "Coursework: Real Analysis, Analytical Geometry, Probability Theory, General and Linear Algebra, Fundamentals of CS, Classical Mechanics, Fundamentals of Electrical Engineering."
            }, 
            {"id": "3",
            "universityName": "Lycée Pilote de Kairouan (Elite High School of Kairouan)",
            "universityDegree": "Baccalaureate in Mathematics & Physics",
            "universityDate": "Kairouan, Tunisia | September 2017 - June 2021",
            "GPA": "Graduated with Honors, GPA: 1.2 ( Ranked 13th nationally, out of 7000 Students)",
            "universityPara1": "Coursework: Real Analysis, Analytical Geometry, Calculus I & II & III, Classical Physics, Electro-magnetism, Chemistry, Computer Science, Philosophy, English, French."
            }

        ],
        "experiences": [
            {
                "id": "1",
                "dates": "September 2023 - Present",
                "location": "TUM, Munich - Germany",
                "type": "Part Time",
                "position": "Teaching Assistant",
                "bullets": "Delivered weekly tutorials for first- and second-semester students in Math 1 and Computational Foundations 1 (wintersemester), Math 2 and Computational Foundations 2 (summer semester), for groups of 20–150 students. #   Prepared lecture summaries, created and solved exercise sheets, and supported students through live Q&A sessions. #Assisted in exam preparation and grading to ensure accurate assessment of the students’ performance."
            }, 
            {
                "id": "2",
                "dates": "October 2024 - Present",
                "location": "Lilium GmbH, Gauting, Munich- Germany",
                "type": "Internship",
                "position": "Propulsion Testing Engineer",
                "bullets": "Optimized test efficiency by automating the parameter setup for different tests in the Ballistic Impact Rig using a machine learning model, improving accuracy, and reducing preparation time by approximately 20%#Delivered and analyzed high-quality test results in multiple test campaigns, including compressor mapping, deep stall studies, and bird impact testing at engine level.#Solved instrumentation challenges by designing, manufacturing and attaching different extensions for two test rigs to optimize sensors positioning#Enhanced data collection and analysis by implementing advanced blade vibration monitoring and aerodynamic instrumentation.#Created comprehensive documentation, adhered to strict EASA-regulated processes, and maintained a creative problem-solving approach during troubleshooting of complex testing scenarios."
            }
        ],
        "extracurr": [
            {"id": "1",
            "universityName": " Author - Prime Numbers, The Holy Grail of Mathematics",
            "universityDegree": " ",
            "universityDate": "October 2020",
            "GPA": "Authored and independently published Prime Numbers, The Holy Grail of Mathematics (ISBN 9798555779014)",
            "universityPara1": "This project aims to create a simplified and a comprehensive guide to prime numbers and their properties. The book covers the history of prime numbers, their distribution, and their applications in cryptography, number theory, and computer science."
            },
            
            
            {"id": "2",
            "universityName": " WARR Rocketry",
            "universityDegree": "Member of the Electronics sub-team",
            "universityDate": "December 2022 - May 2024",
            "universityPara": "Admitted to top preparatory college for Engineering Studies in Tunisia.",
            "GPA": "Active member in largest student initiative @Tum, WARR Rocketry",
            "universityPara1": "KeyResponsibilities include Design and Test of the Flight Computer systems for projects Nixus & Cryosphere (C/C++, GitLab, Embedded systems)"
            }

        ],
        "languages": [
            "Fluent: German, French",
            "Native: Arabic, English"
         
            
        ],
        "frameworks": [
            "Advanced: C/C++, Python",
            "Intermediate : Java, SQL, Javascript, HTML."

        ],
        "others": [
            "Ms Office, Matlab, Hyperworks, SolidWorks, Siemens Nx, Palantir Foundry, Teamcenter PLM"
        ]
    }
}